; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	spectrograph0 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation5 - direction
	Star3 - direction
	Star0 - direction
	Star4 - direction
	GroundStation2 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star0)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star3)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star4)
	(supports instrument8 image1)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
	(supports instrument9 image1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet10)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite1 Star6)
	(pointing satellite4 Star0)
	(have_image Star6 spectrograph0)
	(have_image Planet7 spectrograph0)
	(have_image Star8 image1)
	(have_image Planet9 spectrograph0)
	(have_image Planet10 spectrograph0)
	(have_image Phenomenon11 image1)
))

)

; plan
1. (turn_to satellite1 star6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star6)
   goals met: 1 of 9
2. (turn_to satellite0 groundstation2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 9
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
4. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 9
5. (turn_to satellite0 planet9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet9)
   goals met: 1 of 9
6. (take_image satellite0 planet9 instrument0 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 2 of 9
7. (turn_to satellite0 planet7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet7)
   goals met: 2 of 9
8. (take_image satellite0 planet7 instrument0 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 3 of 9
9. (turn_to satellite0 phenomenon11 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 9
10. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 9
11. (turn_to satellite0 star6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star6)
   goals met: 4 of 9
12. (take_image satellite0 star6 instrument0 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 5 of 9
13. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 5 of 9
14. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 6 of 9
15. (turn_to satellite0 planet10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet10)
   goals met: 7 of 9
16. (take_image satellite0 planet10 instrument0 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 8 of 9
17. (turn_to satellite4 star0 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star0)
   goals met: 9 of 9
